tom38121605/RD_02_mcu_STM32_txt/STM32_01_H7A3_F429_VSCODE/_Awork52_STMH7A3_txt/AUDIO-H7A3RI-RX-V43_18_af_i2s_dmairq_log_k/Src/Apps/Src/audio/audio_rx.c
/**
 * @file      audio_rx.c
 *
 *
 * @brief     Decawave Application level
 *             collection of data transmission bare-metal functions for audio RX
 *
 * @author    Decawave Applications
 *
 * @attention Copyright (c) 2021 - 2022, Qorvo US, Inc.
 * All rights reserved
 * Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright notice, this
 *  list of conditions, and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *  this list of conditions and the following disclaimer in the documentation
 *  and/or other materials provided with the distribution.
 * 3. You may only use this software, with or without any modification, with an
 *  integrated circuit developed by Qorvo US, Inc. or any of its affiliates
 *  (collectively, "Qorvo"), or any module that contains such integrated circuit.
 * 4. You may not reverse engineer, disassemble, decompile, decode, adapt, or
 *  otherwise attempt to derive or gain access to the source code to any software
 *  distributed under this license in binary or object code form, in whole or in
 *  part.
 * 5. You may not use any Qorvo name, trademarks, service marks, trade dress,
 *  logos, trade names, or other symbols or insignia identifying the source of
 *  Qorvo's products or services, or the names of any of Qorvo's developers to
 *  endorse or promote products derived from this software without specific prior
 *  written permission from Qorvo US, Inc. You must not call products derived from
 *  this software "Qorvo", you must not have "Qorvo" appear in their name, without
 *  the prior permission from Qorvo US, Inc.
 * 6. Qorvo may publish revised or new version of this license from time to time.
 *  No one other than Qorvo US, Inc. has the right to modify the terms applicable
 *  to the software provided under this license.
 * THIS SOFTWARE IS PROVIDED BY QORVO US, INC. "AS IS" AND ANY EXPRESS OR IMPLIED
 *  WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 *  MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. NEITHER
 *  QORVO, NOR ANY PERSON ASSOCIATED WITH QORVO MAKES ANY WARRANTY OR
 *  REPRESENTATION WITH RESPECT TO THE COMPLETENESS, SECURITY, RELIABILITY, OR
 *  ACCURACY OF THE SOFTWARE, THAT IT IS ERROR FREE OR THAT ANY DEFECTS WILL BE
 *  CORRECTED, OR THAT THE SOFTWARE WILL OTHERWISE MEET YOUR NEEDS OR EXPECTATIONS.
 * IN NO EVENT SHALL QORVO OR ANYBODY ASSOCIATED WITH QORVO BE LIABLE FOR ANY
 *  DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 *  (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 *  LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 *  ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 *  SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 *
 */

/* Includes */
#include <stdlib.h>
#include <stdint.h>
// #include "stm32f4xx_hal.h"
#include "HAL_error.h"
#include "HAL_uwb.h"
#include "common_audio.h"
#include "audio_rx.h"
#include "circular_buffers.h"
#include "cmsis_os.h"
#include "critical_section.h"
#include "deca_dbg.h"
#include "deca_device_api.h"
#include "driver_app_config.h"
#include "minmax.h"
#include "rf_tuning_config.h"
#include "task_audio_rx.h"
/* Enable USB-UART log output if USB port haven't been used as audio IO*/
#if !USE_USB_AUDIO_PLAYBACK && !USE_USB_AUDIO_RECORDING
#include "usb_uart_tx.h"
#endif

/* Local definitoins for audio output interface USB or I2S */
#if USE_I2S_AUDIO_PLAYBACK
#include "audio_i2s_speaker.h"
static uint8_t i2s_alt_buffer[AUDIO_I2S_DATA_SIZE] = {0};
static uint16_t i2s_pll_num = I2S_PLL_DEFAULT_NUM_N;
#if USE_PLL_CLOCK_AUDIO_SYNC
#include "stm32f4xx_hal_rcc_ex.h"
#else
static i2s_audio_feedback_sync_flag i2s_pll_clock_drift_flag = 0;
#endif
#elif USE_USB_AUDIO_RECORDING
#define TIMER_SYNC_DEFAULT_PERIOD 999
#define TIMER_SYNC_STEP 1
static uint16_t timer_period= TIMER_SYNC_DEFAULT_PERIOD;

extern TIM_HandleTypeDef htim4;
static uint8_t timer_data_buffer[AUDIO_MS_SAMPLE_SIZE] = {0};
#endif

#if UWB_TRANS_DEBUG
/* Counters for debug */
static uint16_t uwb_receive_ok            = 0;
static uint16_t uwb_receive_error              = 0;
static uint16_t uwb_recieve_timeout            = 0;
static uint16_t uwb_receive_msg_error       = 0;
static uint16_t uwb_receive_msg_retry         = 0;
static uint16_t fill_buffer_error             = 0;
static uint16_t fetch_buffer_error            = 0;
static uint16_t audio_data_output_error = 0;
static uint32_t audio_data_output_Call       = 0;
static uint16_t audio_i2s_pll_updated = 0;
#if !USE_USB_AUDIO_RECORDING
static char debug_log_buffer[128];
#endif
#endif

#define RX_BUFFER_DELAY_COUNT 5
/* Buffer to store received frame. */
static uint8_t rx_buffer[FRAME_LEN_MAX_EX];
/* Sequence index for received message*/
static uint8_t rx_msg_sn = 0;
/* Audio streaming status */
static uint8_t rx_streaming_started = FALSE;

#if UWB_TRANS_RETRY_ENABLE && !UWB_RX_ACK_AUTO_ENABLE
/* Buffer to store RESP frame */
/* The frame sent in this example is a data frame encoded as per the IEEE 802.15.4-2011 standard. It is a 21-byte frame composed of the following
 * fields:
 *     - byte 0/1: frame control (0x8861 to indicate a data frame using 16-bit addressing and requesting ACK).
 *       - bits 0-2: Frame Type: 001 - Data frame
 *       - bit 3: Security Enabled: 0 - No security enabled
 *       - bit 4: Frame Pending: 0 - No additional data for recipient
 *       - bit 5: AR: 0 - ACK frame not required from recipient device on receipt of data frame
 *       - bit 6: PAN ID Compression: 1 - PAN IDs are identical, Source PAN ID field shall be omitted from transmitted frame
 *       - bit 7: Reserved: 0
 *       - bit 8: Sequence Number Suppression: 0 - Sequence number field is present
 *       - bit 9: IE Present: 0 - IEs contained in frame
 *       - bits 10-11: Destination Addressing Mode: 10 - Address field contains short address
 *       - bits 12-13: Frame Version: 00 - Using IEEE Std 802.15.4-2003 frames
 *       - bits 14-15: Source Addressing Mode: 10 - Include source address in frame
 *     - byte 2: sequence number, incremented for each new frame.
 *     - byte 3/4: PAN ID (0xADAD)
 *     - byte 5/6: destination address.
 *     - byte 7/8: source address.
 *     - byte 9 to rest: MAC payload.
 *     */
static uint8_t rx_resp_buffer[RESP_FRAME_LEN];
#endif

/* Call back function to transfer received audio data to USB port*/
#if USE_USB_AUDIO_RECORDING
extern void UWB_AUDIO_IN_TransferComplete_CallBack(uint8_t *data_buffer, uint16_t data_size);
#endif

// ----------------------------------------------------------------------------
/**
 * @description: Handle received UWB package 
 * @return {*}
 */
void audio_rx_data_in()
{
    uint8_t * rx_audio_data = rx_buffer + FRAME_DATA_INDEX;
    audio_info_t * info = getAudioInfoPtr();
    uint16_t data_size = info->package_size;
    uint8_t new_msg_sn = rx_buffer[FRAME_SN_IDX];

