tom38121605/RD_02_mcu_STM32_txt/STM32_01_H7A3_F429_VSCODE/_Awork52_STMH7A3_txt/AUDIO-H7A3RI-RX-V43_18_af_i2s_dmairq_log_k/Src/Apps/Src/audio/audio_rx.c
//copy_tx_msg((uint8_t*)"data_in\r\n", 9);  //ok

    /* Check received package's frame control sequence and store audio data accordingly*/
    ++rx_msg_sn;
    if (rx_streaming_started)
    {
//copy_tx_msg((uint8_t*)"d1\r\n", 4);  //ok
        /* Expected sequence, save to audio buffer*/
        if (rx_msg_sn == new_msg_sn)
        {
//copy_tx_msg((uint8_t*)"d11\r\n", 5);  //ok
            audio_buffer_fill_data(rx_audio_data, data_size);
        }
#if UWB_TRANS_RETRY_ENABLE && UWB_TRANS_DEBUG
        /* Duplicate sequence due to TX retransmission, mark and ignore. This happen when transceiver miss ACK from receiver and start retransmission. */
        else if (--rx_msg_sn == new_msg_sn)
        {
copy_tx_msg((uint8_t*)"d12\r\n", 5);  //no
            uwb_receive_msg_retry++;
        }
#endif
        /* Unexpected sequence, packages lost during transmission. */
        else
        {
copy_tx_msg((uint8_t*)"d13\r\n", 5);  //no
            audio_buffer_fill_data(rx_audio_data, data_size);
#if UWB_TRANS_DEBUG
            uwb_receive_msg_error++;
            sprintf(debug_log_buffer, "T:%dR:%d\r\n", rx_msg_sn+1, new_msg_sn);
            copy_tx_msg((uint8_t*)debug_log_buffer, strlen(debug_log_buffer));
#endif
        }
    }
    else
    {
copy_tx_msg((uint8_t*)"d2\r\n", 4);  //play begin
#if UWB_TRANS_DEBUG
        if (audio_buffer_data_size() != 0 && rx_msg_sn != new_msg_sn)
        {
#if UWB_TRANS_RETRY_ENABLE
            if (--rx_msg_sn == new_msg_sn)
            {
                uwb_receive_msg_retry++;
            }
            else
#endif
            {
                uwb_receive_msg_error++;
                sprintf(debug_log_buffer, "T:%dR:%d\r\n", rx_msg_sn+1, new_msg_sn);
                copy_tx_msg((uint8_t*)debug_log_buffer, strlen(debug_log_buffer));
            }
        }
#endif
        
        /* Audio streaming not start yet, fill audio buffer*/
        audio_buffer_fill_data(rx_audio_data, data_size);
    }

    /* Always update the frame control sequence to latest package*/
    rx_msg_sn = new_msg_sn;

    /* Start audio streaming when received data exceed half buffer size*/
    if (audio_buffer_data_size() >= info->data_buffer->size / 2)
    {
//copy_tx_msg((uint8_t*)"d3\r\n", 4);  //ok
        if (!rx_streaming_started)
        {
            rx_streaming_started = TRUE;
            audio_rx_process_trigger();
        }
#if UWB_DATA_TRANS_DEBUG_RX
        // Ignore filled data for debug
        info->data_buffer->rd_ptr = (info->data_buffer->rd_ptr + info->package_size) % info->data_buffer->size;
#endif
    }
}

void audio_rx_process_rx_frame(const uwb_medium_access_t access)
{
    /* ready to serve next raw reception */
#if !UWB_TRANS_RETRY_ENABLE
    dwt_rxenable(DWT_START_RX_IMMEDIATE);
#endif

    uint16_t size = getAudioInfoPtr()->package_size + FCS_LEN + FRAME_DATA_INDEX;
    /* A frame has been received, copy it to our local buffer. */
    if (access.context.datalength == size)
    {
#if UWB_TRANS_DEBUG
        uwb_receive_ok++;
#endif
        uint16_t rx_buffer_offset = 0;
#if UWB_TRANS_RETRY_ENABLE && !UWB_RX_ACK_AUTO_ENABLE
#if USB_RX_USE_DATA_FRAME_RESP && USE_I2S_AUDIO_PLAYBACK && USE_FEEDBACK_AUDIO_SYNC
        rx_resp_buffer[RESP_DATA_INDEX] = i2s_pll_clock_drift_flag;
#endif
        /* Read out frame sn and send response. RX Double buffer must be DISABLED*/
        dwt_readrxdata(rx_buffer, FRAME_DATA_INDEX, rx_buffer_offset);
        rx_buffer_offset += FRAME_DATA_INDEX;
        size -= FRAME_DATA_INDEX;
        rx_resp_buffer[RESP_SN_IDX] = rx_buffer[FRAME_SN_IDX];
        
        /* Write response frame data with received frame sn*/
        dwt_writetxdata(sizeof(rx_resp_buffer)-FCS_LEN, rx_resp_buffer, 0);
        dwt_writetxfctrl(sizeof(rx_resp_buffer), 0, 0);      
        dwt_starttx(DWT_START_TX_IMMEDIATE);
#endif
        /*If using task to handle receiving data instead of ISR, disable interrupt to avoid system hangup.
        Every DWT driver call will lock SPI bus for transmission. If a UWB interrupt trigger and acquire
        SPI bus, which have already been locked by dwt_readrxdata, in ISR, system will been hang due to this
        race condition.*/
#if UWB_RX_USE_TASK
        hal_uwb.disableIRQ();
        dwt_readrxdata(rx_buffer+rx_buffer_offset, size, rx_buffer_offset);
        hal_uwb.enableIRQ();
#else
        dwt_readrxdata(rx_buffer+rx_buffer_offset, size, rx_buffer_offset);
#endif

        audio_rx_data_in();
    }
}

void audio_rx_process_tx_frame_sent(const uwb_medium_access_t access)
{
    dwt_rxenable(DWT_START_RX_IMMEDIATE);
}

void audio_rx_process_rx_error(const uwb_medium_access_t access)
{
    dwt_rxenable(DWT_START_RX_IMMEDIATE);
}

void audio_rx_process_rx_timeout(const uwb_medium_access_t access)
{
    dwt_rxenable(DWT_START_RX_IMMEDIATE);
}

/* @brief   ISR level
 *          Audio application Rx callback
 *          to be called from dwt_isr() as an Rx call-back
 * */
void audio_rx_done_cb(const dwt_cb_data_t *rxd)
{
    uwb_medium_access_t access;
    access.type = UWB_ACCESS_RX_FRAME;
    access.context.status = rxd->status;
    access.context.status_hi = rxd->status_hi;
    access.context.rx_flags = rxd->rx_flags;
    access.context.datalength = rxd->datalength;
    access.context.dss_stat = rxd->dss_stat;
    
#if UWB_RX_USE_TASK
    audio_add_uwb_medium_access(access);
    audio_rx_task_notify(AUDIO_RX_FRAME_NTF);
#else
 //--copy_tx_msg((uint8_t*)"fram1\r\n", 7);  //ok
    audio_rx_process_rx_frame(access);
#endif
}

#if UWB_TRANS_RETRY_ENABLE
/* @brief   ISR level
 *          Audio application RX response tx callback
 *          to be called from dwt_isr() as an Rx call-back
 * */
void audio_rx_resp_cb(const dwt_cb_data_t *rxd)
{
    uwb_medium_access_t access;
    access.type = UWB_ACCESS_TX_FRAME_SENT;
    access.context.status = rxd->status;
    access.context.status_hi = rxd->status_hi;
    access.context.rx_flags = rxd->rx_flags;
    access.context.datalength = rxd->datalength;
    access.context.dss_stat = rxd->dss_stat;
#if UWB_RX_USE_TASK
    audio_add_uwb_medium_access(access);
    audio_rx_task_notify(AUDIO_RX_FRAME_NTF);
#else
    audio_rx_process_tx_frame_sent(access);
#endif
}
#endif

void audio_rx_timeout_cb(const dwt_cb_data_t *rxd)
{
#if UWB_TRANS_DEBUG
    uwb_recieve_timeout++;
#endif
    uwb_medium_access_t access;
    access.type = UWB_ACCESS_RX_TIMEOUT;
    access.context.status = rxd->status;
    access.context.status_hi = rxd->status_hi;
    access.context.rx_flags = rxd->rx_flags;
    access.context.datalength = rxd->datalength;
    access.context.dss_stat = rxd->dss_stat;

#if UWB_RX_USE_TASK
    audio_add_uwb_medium_access(access);
    audio_rx_task_notify(AUDIO_RX_FRAME_NTF);
#else
    audio_rx_process_rx_timeout(access);
#endif
}

void audio_rx_error_cb(const dwt_cb_data_t *rxd)
{
#if UWB_TRANS_DEBUG
    uwb_receive_error++;
#endif
    uwb_medium_access_t access;
    access.type = UWB_ACCESS_RX_ERROR;
    access.context.status = rxd->status;
    access.context.status_hi = rxd->status_hi;
    access.context.rx_flags = rxd->rx_flags;
    access.context.datalength = rxd->datalength;
    access.context.dss_stat = rxd->dss_stat;

#if UWB_RX_USE_TASK
    audio_add_uwb_medium_access(access);
    audio_rx_task_notify(AUDIO_RX_FRAME_NTF);
#else
    audio_rx_process_rx_error(access);
#endif
}

