tom38121605/RD_02_mcu_STM32_txt/STM32_01_H7A3_F429_VSCODE/_Awork52_STMH7A3_txt/AUDIO-H7A3RI-RX-V43_18_af_i2s_dmairq_log_k/Src/Apps/Src/audio/audio_rx.c
//-----------------------------------------------------------------------------

/* @brief     app level
 *     RTOS-independent application level function.
 *     initializing of a Audio Rx functionality.
 *
 * */
error_e audio_rx_process_init()
{
    /* Configure non-zero initial variables.1 : from app parameters */

    /* The AudioRx has its configuration in the app->pConfig, see DEFAULT_CONFIG.
     *
     *
     * */
    dwt_config_t *dwt_config = get_dwt_config();

    /* dwt_xx calls in app level Must be in protected mode (DW3000 IRQ disabled) */
    hal_uwb.disableIRQ();

    AUDIO_ENTER_CRITICAL();

    if (dwt_initialise(0) != DWT_SUCCESS) /**< set callbacks to NULL inside dwt_initialise*/
    {
        return (_ERR_INIT);
    }

    if (hal_uwb.uwbs != NULL)
    {
        hal_uwb.uwbs->spi->fast_rate(hal_uwb.uwbs->spi->handler);
    }

    /* Configure DW IC's UWB mode, sets power and antenna delays for Audio Rx mode
     * Configure SPI to fast rate */
    rf_tuning_t *rf_tuning = get_rf_tuning_config();
    audio_configure_uwb_rxtx(dwt_config,
                         DWT_FF_DATA_EN, /* No frame filtering for AudioRx */
                         rf_tuning->antTx_a,
                         rf_tuning->antRx_a);
#if UWB_TRANS_RETRY_ENABLE
    audio_uwb_init(audio_rx_resp_cb, audio_rx_done_cb, audio_rx_timeout_cb, audio_rx_error_cb, rf_tuning->xtalTrim);
#else
    audio_uwb_init(NULL, audio_rx_done_cb, audio_rx_timeout_cb, audio_rx_error_cb, rf_tuning->xtalTrim);
#endif

    /* End configuration of DW IC */

    AUDIO_EXIT_CRITICAL();

#if UWB_TRANS_RETRY_ENABLE && !UWB_RX_ACK_AUTO_ENABLE
    memset(rx_resp_buffer, 0x0, sizeof(rx_resp_buffer));
#if USB_RX_USE_DATA_FRAME_RESP
    rx_resp_buffer[0] = RESP_FC_0;
    rx_resp_buffer[1] = RESP_FC_1;
    rx_resp_buffer[2] = 0x0;
    rx_resp_buffer[3] = PAN_ID_LO;
    rx_resp_buffer[4] = PAN_ID_HI;
    rx_resp_buffer[5] = DEST_SHORT_ADDR_LO;
    rx_resp_buffer[6] = DEST_SHORT_ADDR_HI;
    rx_resp_buffer[7] = SHORT_ADDR_LO;
    rx_resp_buffer[8] = SHORT_ADDR_HI;
    rx_resp_buffer[9] = 0x0;
#else
    rx_resp_buffer[0] = RESP_FC_0;
    rx_resp_buffer[1] = RESP_FC_1;
    rx_resp_buffer[2] = 0x0;
#endif
#endif
    audio_buffer_init();

    return (_NO_ERR);
}

/*
 * @brief
 *     Enable DW3000 IRQ to start
 * */
void audio_rx_process_start(void)
{
    hal_uwb.enableIRQ();
    dwt_rxenable(DWT_START_RX_IMMEDIATE);
}

/* @brief     app level
 *     RTOS-independent application level function.
 *     deinitialize the pAudioInfo structure.
 *    This must be executed in protected mode.
 *
 * */
void audio_rx_process_deinit(void)
{
    rx_streaming_started = FALSE;
    rx_msg_sn = 0;
#if USE_PLL_CLOCK_AUDIO_SYNC 
    i2s_pll_num = I2S_PLL_DEFAULT_NUM_N;
    __HAL_RCC_PLLI2S_CONFIG(I2S_PLL_DEFAULT_NUM_N, I2S_PLL_DEFAULT_NUM_R);
#endif
    audio_uwb_deinit();
    audio_buffer_deinit();
}

/**
 * @description: Start audio streaming to DAC
 * @return {*}
 */
void audio_rx_process_trigger()
{
#if USE_I2S_AUDIO_PLAYBACK
    if (rx_streaming_started)
    {
        if (0 == audio_buffer_read_check(AUDIO_I2S_DATA_SIZE))
        {
            audio_info_t * info = getAudioInfoPtr();
            uint8_t *data_buffer = info->data_buffer->data;
            uint16_t current_rd_ptr = info->data_buffer->rd_ptr;
            audio_i2s_start(data_buffer + current_rd_ptr, AUDIO_I2S_DATA_SIZE);
            current_rd_ptr = (current_rd_ptr + AUDIO_I2S_DATA_SIZE) % info->data_buffer->size;
            audio_buffer_update_rd_ptr(current_rd_ptr);
        }
    }
#endif
}

/**
 * @description: Read out received audio sample to DAC when I2S DMA shift
 * @return {*}
 */
void audio_rx_data_out()
{
    audio_data_output_Call++;

//copy_tx_msg((uint8_t*)"rxout\r\n", 7);  //ok

    if (rx_streaming_started)
    {
#if USE_I2S_AUDIO_PLAYBACK
        if (0 == audio_buffer_read_check(AUDIO_I2S_DATA_SIZE))
        {
//copy_tx_msg((uint8_t*)"rxout1\r\n", 8);     //ok
            audio_info_t * info = getAudioInfoPtr();
            uint8_t *data_buffer = info->data_buffer->data;
            uint16_t current_rd_ptr = info->data_buffer->rd_ptr;
            audio_i2s_update_buffer(data_buffer + current_rd_ptr, AUDIO_I2S_DATA_SIZE);
            current_rd_ptr = (current_rd_ptr + AUDIO_I2S_DATA_SIZE) % info->data_buffer->size;
            audio_buffer_update_rd_ptr(current_rd_ptr);
            audio_rx_sample_resync();
        }
        else
        {
            memset(i2s_alt_buffer, 0x0, sizeof(i2s_alt_buffer));
            audio_i2s_update_buffer(i2s_alt_buffer, sizeof(i2s_alt_buffer));
            audio_buffer_reset();
            rx_streaming_started = FALSE;
            rx_msg_sn = 0;
#if USE_PLL_CLOCK_AUDIO_SYNC
            i2s_pll_num = I2S_PLL_DEFAULT_NUM_N;
            __HAL_RCC_PLLI2S_CONFIG(I2S_PLL_DEFAULT_NUM_N, I2S_PLL_DEFAULT_NUM_R);
#endif
#if UWB_TRANS_DEBUG
            audio_data_output_error++;
#endif
        }
#elif USE_USB_AUDIO_RECORDING

        if (0 == audio_buffer_fetch_data(timer_data_buffer, getAudioInfoPtr()->ms_audio_sample_size))
        {
            UWB_AUDIO_IN_TransferComplete_CallBack(timer_data_buffer, getAudioInfoPtr()->ms_audio_sample_size);
            audio_rx_sample_resync();
        }
        else
        {
            audio_buffer_reset();
            rx_streaming_started = FALSE;
            rx_msg_sn = 0;
            memset(timer_data_buffer, 0x0, sizeof(timer_data_buffer));
            timer_period = TIMER_SYNC_DEFAULT_PERIOD;
#if UWB_TRANS_DEBUG
            audio_data_output_error++;
#endif
        }
#endif
    }
    else
    {
    #if USE_I2S_AUDIO_PLAYBACK
        audio_i2s_pause();
    #elif USE_USB_AUDIO_RECORDING
        UWB_AUDIO_IN_TransferComplete_CallBack(timer_data_buffer, getAudioInfoPtr()->ms_audio_sample_size);
    #endif
    }
}

void audio_rx_update_package_size(uint16_t ms_audio_sample_size)
{
    audio_update_package_size(ms_audio_sample_size);
}

uint16_t audio_rx_get_sync_value()
{
    if (rx_streaming_started)
    {
        return getAudioInfoPtr()->data_buffer->rd_ptr;
    }
    return 0;
}

uint16_t audio_rx_get_buffer_size()
{
    return AUDIO_UWB_BUFFER_SIZE;
}

/**
 * @description: Adjust I2S clack according to UWB receiving package buffer size
 * @return {*}
 */
void audio_rx_sample_resync(void)
{
#if USE_I2S_AUDIO_PLAYBACK
    uint16_t data_size = audio_buffer_data_size();
    uint16_t buffer_size_half = getAudioInfoPtr()->data_buffer->size / 2;
    uint16_t new_i2s_pll_num = i2s_pll_num;

