tom38121605/RD_02_mcu_STM32_txt/STM32_01_H7A3_F429_VSCODE/_Awork52_STMH7A3_txt/AUDIO-H7A3RI-RX-V43_18_af_i2s_dmairq_log_k/Src/Apps/Src/audio/audio_rx.c
    // Slightly adjust I2S PLL to speed up or down audio consumption to adapt the sample rate of UWB TX side
    if (data_size > (buffer_size_half + I2S_PLL_ADJUST_THRESHOLD))
    {
        if(i2s_pll_num <= I2S_PLL_DEFAULT_NUM_N)
		{
			new_i2s_pll_num = i2s_pll_num + 1;
		}
    }
    else if (data_size < (buffer_size_half - I2S_PLL_ADJUST_THRESHOLD))
    {
        if(i2s_pll_num >= I2S_PLL_DEFAULT_NUM_N)
		{
			new_i2s_pll_num = i2s_pll_num - 1;
		}
    }
    else if (data_size == buffer_size_half)
    {
        new_i2s_pll_num = I2S_PLL_DEFAULT_NUM_N;
    }
    
    if(new_i2s_pll_num != i2s_pll_num)
    {
#if USE_PLL_CLOCK_AUDIO_SYNC
        __HAL_RCC_PLLI2S_CONFIG(new_i2s_pll_num,I2S_PLL_DEFAULT_NUM_R);
#else
        if (new_i2s_pll_num > I2S_PLL_DEFAULT_NUM_N)
        {
            i2s_pll_clock_drift_flag = I2S_AUDIO_OVERRUN;
        }
        else if (new_i2s_pll_num < I2S_PLL_DEFAULT_NUM_N)
        {
            i2s_pll_clock_drift_flag = I2S_AUDIO_UNDERRUN;
        }
        else
        {
            i2s_pll_clock_drift_flag = I2S_AUDIO_NORMAL;
        }
#endif
        i2s_pll_num = new_i2s_pll_num;
#if UWB_TRANS_DEBUG
        audio_i2s_pll_updated++;
#endif
    }
#elif USE_USB_AUDIO_RECORDING
    uint16_t data_size = audio_buffer_data_size();

    if (data_size > getAudioInfoPtr()->buffer->size / 2)
    {
        timer_period = timer_period - TIMER_SYNC_STEP;
    }
    else if (data_size < getAudioInfoPtr()->buffer->size / 2)
    {
        timer_period = timer_period + TIMER_SYNC_STEP;
    }
    else
    {
        timer_period = TIMER_SYNC_DEFAULT_PERIOD;
    }

    __HAL_TIM_SET_AUTORELOAD(&htim4, timer_period);
#endif
}

static uint16_t debug_receive_ok[10] = {0};
static uint16_t debug_receive_err[10] = {0};
static uint16_t debug_receive_to[10] = {0};
static uint32_t debug_audio_i2s_call[10] = {0};
static uint16_t debug_index = {0};


void audio_rx_debug_output()
{
#if UWB_TRANS_DEBUG
    if (uwb_receive_ok || uwb_receive_error
    || uwb_recieve_timeout || uwb_receive_msg_error
    || uwb_receive_msg_retry || fill_buffer_error
    || fetch_buffer_error || audio_data_output_error)
    {
        debug_receive_ok[debug_index] = uwb_receive_ok;
        debug_receive_err[debug_index] = uwb_receive_error;
        debug_receive_to[debug_index] = uwb_receive_msg_error;
        debug_audio_i2s_call[debug_index] = audio_data_output_Call;

        if (++debug_index > 9)
        {
            debug_index = 0;
        }
        // STM32CubeIDE Breakpoint log: "%dR%dE%dT%dS-Buffer:%d-%d-Sample:%d\r\n",  uwb_receive_ok, uwb_receive_error, uwb_recieve_timeout, uwb_receive_msg_error, fill_buffer_error, fetch_buffer_error, audio_data_output_error
        // VSCode Breakpoint log: "%dR%dE%dT%dS-Buffer:%d-%d-Sample:%d-Resp:%d\r\n" uwb_receive_ok uwb_receive_error uwb_recieve_timeout uwb_receive_msg_error fill_buffer_error fetch_buffer_error audio_data_output_error uwb_receive_msg_retry
#if !USE_USB_AUDIO_PLAYBACK && !USE_USB_AUDIO_RECORDING
        sprintf(debug_log_buffer, "\"R:%5d\",\"E:%5d\",\"T:%5d\",\"S:%5d\",\"Buffer5:%5d-%5d\",\"Retry:%5d-%5d\",\"I2s:%5d\"\r\n", uwb_receive_ok, 
        uwb_receive_error, uwb_recieve_timeout, uwb_receive_msg_error, fill_buffer_error, fetch_buffer_error,
        uwb_receive_msg_retry, audio_data_output_error, audio_i2s_pll_updated);
        copy_tx_msg((uint8_t*)debug_log_buffer, strlen(debug_log_buffer));
#endif
        uwb_receive_ok          = 0;
        uwb_receive_error       = 0;
        uwb_recieve_timeout     = 0;
        uwb_receive_msg_error   = 0;
        uwb_receive_msg_retry   = 0;
        fill_buffer_error       = 0;
        fetch_buffer_error      = 0;
        audio_data_output_error = 0;
        audio_i2s_pll_updated   = 0;
        audio_data_output_Call = 0;
    }
#endif
}
//-----------------------------------------------------------------------------
